Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# ErrorResource_ErrCannotCoerce_SourceType_TargetType_LongMessage
source: Power Apps can convert some types of data in your formula to other types for you. For example, it can convert "1" (a string) to a 1 (a number), but it can't all data types to all other data type. For example, it can't convert an image to a number.
bg_bg: Power Apps може да преобразува някои типове данни във вашата формула в други типове вместо вас. Например може да преобразува „1“ (низ) в 1 (число), но не може всички типове данни във всички други типове данни. Например не може да преобразува изображение в число.
ca_es: El Power Apps pot convertir automàticament alguns tipus de dades de la vostra fórmula en altres tipus. Per exemple, pot convertir "1" (una cadena) en 1 (un nombre), però no pot convertir tots els tipus de dades en qualsevol altre tipus de dades. Per exemple, no pot convertir una imatge en un nombre.
cs_cz: Power Apps může převést některé typy dat ve vzorci na jiné typy za vás. Umí například převést "1" (řetězec) na 1 (číslo), ale ne všechny datové typy se dají převést na jakýkoli jiný. Například obrázek se na číslo převést nedá.
da_dk: Power Apps kan konvertere nogle datatyper i din formel til andre typer. Den kan f.eks. konvertere "1" (en streng) til 1 (et tal), men den kan ikke konvertere alle datatyper til alle andre datatyper. Den kan f.eks. ikke den konvertere et billede til et tal.
de_de: Power Apps kann einige Datentypen in der Formel für Sie in andere Typen konvertieren. Beispielsweise kann "1" (eine Zeichenfolge), in 1 (eine Zahl) konvertiert werden. Es können jedoch nicht alle Datentypen in alle anderen Datentypen konvertiert werden. Ein Bild kann beispielsweise nicht in eine Zahl konvertiert werden.
el_gr: Το Power Apps μπορεί να μετατρέψει ορισμένους τύπους δεδομένων στον τύπο σας σε άλλους τύπους για λογαριασμό σας. Για παράδειγμα, μπορεί να μετατρέψει το "1" (συμβολοσειρά) σε 1 (αριθμό), αλλά δεν μπορεί να μετατρέψει όλους τους τύπους δεδομένων σε όλους τους άλλους τύπους δεδομένων. Για παράδειγμα, δεν μπορεί να μετατρέψει μια εικόνα σε αριθμό.
es_es: Power Apps puede convertir algunos tipos de datos de la fórmula a otros tipos automáticamente. Por ejemplo, puede convertir "1" (una cadena) en 1 (un número), pero no todos los tipos de datos a todos los demás tipos de datos. Por ejemplo, no puede convertir una imagen en un número.
et_ee: Power Apps võib teie valemis teisendada mõned andmetüübid teisteks tüüpideks. Näiteks saab see teisendada tüübi "1" (string) tüübiks 1 (arv), kuid see ei saa teisendada kõiki andmetüüpe kõigiks teisteks andmetüüpideks. Näiteks ei saa Power Apps teisendada pilti arvuks.
eu_es: Power Apps-ek formulako zenbait daturen mota alda dezake. Adibidez, "1" (kate bat) 1 (zenbaki bat) bihur dezake, baina ezin ditu aldatu datu mota guztiak beste datu mota batzuk. Adibidez, ezin ditu bihurtu irudiak zenbaki.
fi_fi: Power Apps voi muuntaa kaavasi joidenkin tietojen tyypit muiksi tyypeiksi puolestasi. Se voi esimerkiksi muuntaa kohteen "1" (merkkijono) kohteeksi 1 (luku), mutta se ei muuntaa kaikkia tietotyyppejä kaikiksi muiksi tietotyypeiksi. Se ei esimerkiksi voi muuntaa kuvaa luvuksi.
fr_fr: Power Apps peut convertir des types de données dans votre formule en d'autres types pour vous. Par exemple, il peut convertir « 1 » (une chaîne) en 1 (un nombre), mais il ne peut pas convertir tous les types de données dans tous les autres types de données. Par exemple, il ne peut pas convertir une image en nombre.
gl_es: Power Apps pode converter algúns tipos de datos da fórmula noutros. Por exemplo, pode converter "1" (unha cadea) en 1 (un número), pero non pode converter todos os tipos de datos noutros tipo de datos. Por exemplo, non pode converter unha imaxe nun número.
hi_in: Power Apps आपके सूत्र में कुछ प्रकार के डेटा को आपके लिए अन्य प्रकारों में रूपांतरित कर सकते हैं. उदाहरण के लिए, यह "1" (एक स्ट्रिंग) को 1 (एक संख्या) में रूपांतरित कर सकता है, लेकिन यह सभी डेटा प्रकारों को अन्य सभी डेटा प्रकारों में रूपांतरित नहीं कर सकता है. उदाहरण के लिए, यह किसी छवि को किसी संख्या में रूपांतरित नहीं कर सकता है.
hr_hr: Power Apps ne može pretvoriti neke vrste podataka u formuli u druge vrste. Na primjer, može pretvoriti "1" (nit) u 1 (broj), ali ne može pretvoriti sve vrste podataka u sve druge vrste podataka. Na primjer, ne može pretvoriti sliku u broj.
hu_hu: A Power Apps a képletben szereplő adattípusok közül néhányat konvertálni tud más típusokra. Az 1 sztringet például konvertálni tudja az 1 számra, de minden adattípust nem tud konvertálni az összes egyéb adattípusra. Nem tud például egy képet számra konvertálni.
it_it: Power Apps può convertire automaticamente alcuni tipi di dati della formula in altri tipi. Ad esempio, può convertire "1" (stringa) in 1 (numero), ma non può convertire tutti i tipi di dati in tutti gli altri tipi di dati. Ad esempio, non può convertire un'immagine in un numero.
ja_jp: Power Apps は、数式のいくつかのデータ型を他の型に変換できます。たとえば、"1" (文字列) を "1" (数値) に変換できますが、すべてのデータ型を他のすべてのデータ型へ変換できるわけではありません。たとえば、画像を数値に変換できません。
kk_kz: Power Apps формуладағы деректердің кейбір түрлерін басқа түрлерге түрлендіре алады. Мысалы, ол "1" (жол) мәнін 1 (сан) етіп түрлендіре алады, бірақ ол барлық деректер түрлерін барлық басқа деректер түріне түрлендіре алмайды. Мысалы, ол кескінді санға түрлендіре алмайды.
ko_kr: Power Apps에서는 수식에 있는 일부 데이터 형식을 다른 형식으로 변환할 수 있습니다. 예를 들어 "1"(문자열)을 1(숫자)로 변환할 수 있지만, 일부 데이터 형식은 다른 데이터 형식으로 변환할 수 없습니다. 예를 들어 이미지를 숫자로 변환할 수는 없습니다.
lt_lt: „Power Apps“ gali konvertuoti kai kuriuos jūsų formulės duomenų tipus į kitus tipus. Pavyzdžiui, ji gali konvertuoti „1“ (eilutė) į 1 (skaičius), tačiau negali konvertuoti visų duomenų tipų į visus kitus duomenų tipus. Pavyzdžiui, ji negali konvertuoti vaizdo į skaičių.
lv_lv: Power Apps formulās var pārvērst dažu tipu datus par citu tipu datiem, piemēram, virkni “1” var pārvērst par skaitli “1”. Taču nevar pārvērst jebkura tipa datus par jebkura cita tipa datiem, piemēram, attēlu nevar pārvērst par skaitli.
ms_my: Power Apps boleh menukar beberapa jenis data dalam formula anda kepada jenis lain untuk anda. Contohnya, ia boleh menukar "1" (rentetan) kepada 1 (nombor), tetapi ia tidak boleh menukar semua jenis data kepada semua jenis data yang lain. Contohnya, ia tidak boleh menukar imej kepada nombor.
nb_no: Power Apps kan konvertere noen datatyper i formelen til andre typer for deg. For eksempel den kan konvertere «1» (en streng) til 1 (et tall), men den kan ikke konvertere alle datatyper til alle andre datatyper. Den kan for eksempel ikke konvertere et bilde til et tall.
nl_nl: Power Apps kan bepaalde gegevenstypen in de formule voor u converteren naar andere typen. Het is bijvoorbeeld mogelijk om de tekenreeks 1 te converteren naar het getal 1, maar niet alle gegevenstypen kunnen in andere typen worden omgezet. Een afbeelding kan bijvoorbeeld niet naar een getal worden geconverteerd.
pl_pl: Usługa Power Apps może przekonwertować niektóre typy danych w formule na inne typy. Na przykład może przekonwertować wartość „1” (ciąg) na wartość 1 (liczba), ale nie może konwertować wszystkich typów danych na wszystkie inne typy danych. Na przykład nie może przekonwertować obrazu na liczbę.
pt_br: O Power Apps pode converter alguns tipos de dados na sua fórmula em outros tipos. Por exemplo, ele pode converter "1" (uma cadeia de caracteres) em 1 (um número), mas ele não pode converter todos os tipos de dados em todos os outros tipos de dados. Por exemplo, ele não pode converter uma imagem em um número.
pt_pt: O Power Apps pode converter alguns tipos de dados na sua fórmula para outros tipos por si. Por exemplo, pode converter "1" (uma cadeia) para um 1 (um número), mas não pode converter todos os tipos de dados para todos outros tipos de dados. Por exemplo, não pode converter uma imagem para um número.
ro_ro: Power Apps poate converti anumite tipuri de date din formulă la alte tipuri. De exemplu poate converti „1” (șir) la 1 (număr), dar nu poate converti toate tipurile de date de un tip, la toate celelalte tipuri de date. De exemplu nu poate converti o imagine la un număr.
ru_ru: Power Apps может преобразовывать некоторые типы данных в формуле в другие типы. Например, значение "1" (строка) можно преобразовать в 1 (число). Однако это верно не для всех типов данных. Например, преобразовать изображение в число будет невозможно.
sk_sk: Služba Power Apps môže za vás previesť niektoré typy údajov vo vzorci na iné typy. Môže napríklad previesť „1“ (reťazec) na 1 (číslo), no nie všetky typy údajov sa dajú previesť na akýkoľvek iný typ. Napríklad obrázok sa nedá previesť na číslo.
sl_si: Power Apps lahko nekatere vrste podatkov v vaši formuli pretvori v druge vrste. Pretvori lahko na primer »1« (niz) v 1 (število), vendar pa ne more pretvoriti vseh podatkovnih tipov v vse druge podatkovne tipe. Slike na primer ne more pretvoriti v število.
sr_cyrl_rs: Power Apps може да конвертује неке типове података из формуле у друге. На пример, може да конвертује „1“ (ниска) у 1 (број), али не може да конвертује све типове података у све друге типове података. На пример, не може да конвертује слику у број.
sr_latn_rs: Power Apps može da konvertuje neke tipove podataka iz formule u druge. Na primer, može da konvertuje „1“ (niska) u 1 (broj), ali ne može da konvertuje sve tipove podataka u sve druge tipove podataka. Na primer, ne može da konvertuje sliku u broj.
sv_se: Power Apps kan konvertera vissa typer av data i din formel till andra typer åt dig. Det kan till exempel konvertera ”1” (en sträng) till 1 (ett tal), men det kan inte konvertera alla datatyper till alla andra datatyper. Det kan till exempel inte konvertera en bild till ett tal.
th_th: Power Apps สามารถแปลงข้อมูลบางชนิดในสูตรของคุณให้เป็นชนิดอื่นได้ ตัวอย่างเช่น สามารถแปลง "1" (สตริง) เป็น 1 (ตัวเลข) ได้ แต่จะไม่สามารถแปลงข้อมูลทุกชนิดให้เป็นชนิดข้อมูลอื่นทุกชนิดได้ ตัวอย่างเช่น ไม่สามารถแปลงรูปเป็นตัวเลขได้
tr_tr: Power Apps sizin için formülünüzdeki bazı veri türlerini diğer türlere dönüştürebilir. Örneğin, "1" (dize) değerini 1 (sayı) değerine dönüştürebilir ancak tüm veri türlerini diğer tüm veri türlerine dönüştürülemez. Örneğin, bir resmi sayıya dönüştüremez.
uk_ua: Power Apps може перетворити деякі типи даних у формулі. Наприклад, можна перетворити "1" (рядок) на 1 (число). Проте перетворення можливі лише між певними типами даних. Скажімо, зображення не можна перетворити на число.
vi_vn: Power Apps có thể chuyển đổi một số kiểu dữ liệu trong công thức của bạn thành các kiểu khác. Ví dụ: Power Apps có thể chuyển đổi "1" (chuỗi) thành 1 (số) nhưng ứng dụng này không thể chuyển đổi tất cả kiểu dữ liệu thành các loại dữ liệu khác. Ví dụ: Power Apps không thể chuyển đổi hình ảnh thành số.
zh_cn: Power Apps 可将公式中部分类型的数据转换成其他类型，例如，它可将 "1" (字符串)转换为 1 (数字)。但是，它并不能将所有数据类型都转换成不同的数据类型，例如，它不能将图像转换成数字。
zh_tw: Power Apps 可為您將公式中的部分資料類型，轉換為其他類型。例如，其可將 "1" (字串) 轉換為 1 (數字)，但其無法將所有資料類型，都轉換為所有其他資料類型。例如，它無法將影像轉換為數字。

# ErrorResource_ErrCannotCoerce_SourceType_TargetType_HowToFix_1
source: Edit your formula so that you convert the data in question to the expected type.
bg_bg: Редактирайте формулата си така, че да преобразувате въпросните данни в очаквания тип.
ca_es: Editeu la fórmula per convertir les dades en qüestió al tipus esperat.
cs_cz: Upravte svůj vzorec tak, abyste převedli daná data na očekávaný typ.
da_dk: Rediger din formel, så du konverterer de pågældende data til den forventede type.
de_de: Bearbeiten Sie die Formel so, dass die fraglichen Daten in den erwarteten Typ konvertiert werden.
el_gr: Επεξεργαστείτε τον τύπο, ώστε να μετατρέψετε τα εν λόγω δεδομένα στον αναμενόμενο τύπο.
es_es: Edite la fórmula para convertir los datos en cuestión al tipo esperado.
et_ee: Redigeerige oma valemit nii, et teisendate kõnealused andmed eeldatud tüübiks.
eu_es: Editatu formula, datu jakin horiek espero den motakoak izan daitezen.
fi_fi: Muokkaa kaavaa niin, että muunnat kyseiset tiedot odotetuksi tyypiksi.
fr_fr: Modifiez votre formule afin que vous convertissez les données en question dans le type attendu.
gl_es: Edite a fórmula para converter os datos da pregunta no tipo esperado.
hi_in: अपने सूत्र को संपादित करें ताकि आप प्रश्न को अपेक्षित प्रकार में परिवर्तित कर सकें.
hr_hr: Uredite formulu tako da odgovarajuće podatke pretvorite u u očekivanu vrstu.
hu_hu: Módosítsa a képletet úgy, hogy az érintett adatokat a várt típusra konvertálja.
it_it: Modificare la formula per convertire i dati in questione nel tipo previsto.
ja_jp: 数式を編集して、問題のデータを必要な型に変換します。
kk_kz: Формуланы тиісті деректерді күтілген түрге түрлендіретіндей етіп өзгертіңіз.
ko_kr: 요청한 데이터를 필요한 형식으로 변환하도록 수식을 편집합니다.
lt_lt: Redaguokite savo formulę taip, kad atitinkamus duomenis konvertuotumėte į numatytą tipą.
lv_lv: Rediģējiet formulu, lai pārvērstu attiecīgos datus paredzētā tipa datos.
ms_my: Edit formula anda supaya anda menukar data dalam soalan kepada jenis yang dijangka.
nb_no: Rediger formelen slik at du konverterer de aktuelle dataene til den forventede typen.
nl_nl: Bewerk de formule zodat u de betrokken gegevens naar het verwachte type kunt converteren.
pl_pl: Edytuj formułę tak, aby przekonwertować odpowiednie dane na dane oczekiwanego typu.
pt_br: Edite sua fórmula, convertendo os dados em questão para o tipo esperado.
pt_pt: Edite a fórmula para converter os dados em questão para o tipo esperado.
ro_ro: Editați formula astfel încât să faceți conversia datelor în cauză la tipul așteptat.
ru_ru: Измените формулу, чтобы преобразовать эти данные к ожидаемому типу.
sk_sk: Upravte vzorec tak, aby ste previedli príslušné údaje na očakávaný typ.
sl_si: Uredite formulo tako, da želene podatke pretvoriti v pričakovani tip.
sr_cyrl_rs: Уредите формулу тако да конвертујете дате податке у очекивани тип.
sr_latn_rs: Uredite formulu tako da konvertujete date podatke u očekivani tip.
sv_se: Redigera din formel så att du konverterar berörda data till den förväntade typen.
th_th: แก้ไขสูตรของคุณเพื่อให้คุณแปลงข้อมูลที่มีปัญหาให้เป็นชนิดที่คาดไว้
tr_tr: Formülünüzü söz konusu verileri beklenen türe dönüştürecek şekilde düzenleyin.
uk_ua: Змініть формулу так, щоб перетворити тип даних на очікуваний.
vi_vn: Chỉnh sửa công thức để bạn có thể chuyển đổi dữ liệu đang được đề cập đến sang kiểu dự kiến.
zh_cn: 请编辑公式，以便将存在问题的数据转换成预期类型。
zh_tw: 編輯公式，以便將有問題的資料轉換成預期的類型。

# ErrorResource_ErrStringExpected_ShortMessage
source: Expected text. We expect text at this point in the formula.
bg_bg: Очаква се текст. Очакваме текст на този етап във формулата.
ca_es: S'esperava text. S'espera text en aquest punt de la fórmula.
cs_cz: Očekával se text. V této části vzorce očekáváme text.
da_dk: Tekst forventet. Vi forventer tekst på dette sted i formlen.
de_de: Text erwartet. An dieser Stelle in der Formel wird Text erwartet.
el_gr: Αναμενόταν κείμενο. Σε αυτό το σημείο στον τύπο αναμένεται κείμενο.
es_es: Se esperaba texto. Se esperaba texto en este punto de la fórmula.
et_ee: Eeldati teksti. Siinkohal eeldame valemis teksti.
eu_es: Testua espero zen. Testua izan behar du formularen puntu horrek.
fi_fi: Odotettiin tekstiä. Tekstiä odotetaan kaavan tässä kohdassa.
fr_fr: Du texte est attendu. Nous attendons du texte à ce stade de la formule.
gl_es: Esperábase texto neste punto da fórmula.
hi_in: पाठ अपेक्षित है. हम सूत्र में इस बिंदु पर पाठ की अपेक्षा रखते हैं.
hr_hr: Očekuje se tekst. Na tom mjestu u formuli očekujemo tekst.
hu_hu: A rendszer szöveget várt a képlet ezen pontján.
it_it: È previsto un testo. A questo punto della formula è previsto un testo.
ja_jp: テキストが必要です。数式のこの時点で、テキストが必要です。
kk_kz: Мәтін күтілген. Формуладағы бұл жерде мәтін күтіледі.
ko_kr: 텍스트가 필요합니다. 수식에서 이 지점에 텍스트가 필요합니다.
lt_lt: Numatomas tekstas. Šioje formulės dalyje numatomas tekstas.
lv_lv: Ir paredzēts teksts. Šajā formulas posmā tiek gaidīts teksts.
ms_my: Menjangkakan teks. Kami menjangkakan teks pada masa ini dalam formula.
nb_no: Forventet tekst. Vi forventer tekst på dette stedet i formelen.
nl_nl: Er wordt een tekst verwacht. Op deze positie in de formule wordt een tekst verwacht.
pl_pl: Oczekiwano tekstu. W tym miejscu w formule oczekujemy tekstu.
pt_br: Texto esperado. Esperamos um texto neste ponto na fórmula.
pt_pt: Texto esperado. Era esperado texto nesta parte da fórmula.
ro_ro: Se aștepta text. Așteptăm un text în acest punct din formulă.
ru_ru: Ожидался текст. В этой точке формулы должен быть текст.
sk_sk: Očakával sa text. V tomto bode vzorca sa očakáva text.
sl_si: Pričakovano je besedilo. Na tem mestu v formuli je pričakovano besedilo.
sr_cyrl_rs: Очекује се текст. Очекујемо текст у овом делу формуле.
sr_latn_rs: Očekuje se tekst. Očekujemo tekst u ovom delu formule.
sv_se: Text förväntades. Vi förväntar oss text vid den här punkten i formeln.
th_th: ข้อความที่คาดไว้ เราคาดหวังข้อความในจุดนี้ในสูตร
tr_tr: Metin bekleniyor. Formülde bu noktada bir metin bekleniyor.
uk_ua: Очікувався текст. У цьому місці формули очікується текст.
vi_vn: Đã dự kiến có văn bản. Chúng tôi dự kiến có văn bản tại điểm này trong công thức.
zh_cn: 应为文本。公式中的此处应使用文本。
zh_tw: 應為文字。公式中的此位置應為文字。

# ErrorResource_ErrStringExpected_LongMessage
source: This error occurs if you use a function that requires a text (or string) argument and you supply, for example, a date instead.
bg_bg: Тази грешка възниква, ако използвате функция, която изисква аргумент с текст (или низ), а вие например предоставите дата вместо това.
ca_es: Aquest error es produeix si utilitzeu una funció que requereix un argument de text (o cadena), però proporcioneu, per exemple, una data.
cs_cz: K této chybě dojde v případě, že použijete funkci, která vyžaduje textový (nebo řetězcový) argument, ale místo něj zadáte například datum.
da_dk: Denne fejl opstår, hvis du bruger en funktion, der kræver et argument af typen tekst (eller streng), og du f.eks. angiver en dato i stedet for.
de_de: Dieser Fehler tritt auf, wenn Sie eine Funktion verwenden, die ein Textargument (oder ein Zeichenfolgenargument) erwartet, Sie aber stattdessen z. B. ein Datum angeben.
el_gr: Αυτό το σφάλμα παρουσιάζεται, αν χρησιμοποιήσετε μια συνάρτηση που απαιτεί ένα όρισμα κειμένου (ή συμβολοσειράς), αλλά παρέχετε, για παράδειγμα, μια ημερομηνία στη θέση του.
es_es: Este error se produce si usa una función que requiere un argumento de texto (o cadena) y, por ejemplo, proporciona una fecha.
et_ee: See tõrge ilmneb, kui kasutate funktsiooni, mis nõuab teksti (või stringi) argumenti, kuid teie esitate selle asemel nt kuupäeva.
eu_es: Adibidez, errore hori gertatuko da data bat erabiltzen baduzu testu-argumentu bat (edo kate bat) behar duen funtzio batean.
fi_fi: Tämä virhe ilmenee, jos käytät funktiota, joka edellyttää tekstiargumenttia (tai merkkijonoargumenttia), mutta annat sen sijaan esimerkiksi päivämäärän.
fr_fr: Cette erreur se produit si vous utilisez une fonction qui nécessite un argument sous forme de texte (ou de chaîne) alors que vous fournissez, par exemple, une date.
gl_es: Este erro prodúcese se usa unha función que precisa un argumento de texto (ou unha cadea) e fornece, por exemplo, unha data no seu lugar.
hi_in: यदि आप किसी ऐसे फ़ंक्शन का उपयोग करते हैं, जिसके लिए किसी पाठ (या स्ट्रिंग) तर्क की आवश्यकता होती है और आप, उदाहरण के लिए, कोई दिनांक प्रदान करते हैं, तो यह त्रुटि होगी.
hr_hr: Ta će se pogreška pojaviti ako koristite funkciju koja zahtijeva tekst (ili niz), no vi ste, primjerice, umjesto njega unijeli datum.
hu_hu: Ez a hiba akkor fordul elő, ha szöveges (vagy sztring-) argumentumot igénylő függvényt használ, de például dátumot ad meg.
it_it: Questo errore si verifica se si usa una funzione che richiede argomento di testo (o stringa), ma si specifica, ad esempio, una data.
ja_jp: このエラーは、テキスト (または文字列) 引数が必要な関数を使用するときに日付などを指定した場合に生じます。
kk_kz: Мәтін (немесе жол) аргументін қажет ететін функцияны пайдалансаңыз, бірақ оның орнына, мысалы, күнді көрсетсеңіз, осы қате пайда болады.
ko_kr: 이 오류는 텍스트(또는 문자열) 인수가 필요한 함수를 사용하는데 날짜 등을 입력하는 경우에 발생합니다.
lt_lt: Ši klaida įvyks, jei naudosite funkciją, reikalaujančią teksto (arba eilutės) argumento, o jūs pateiksite, pvz., datą.
lv_lv: Šī kļūda rodas, ja izmantojat funkciju, kurai ir nepieciešams teksta (vai virknes) arguments, bet tā vietā funkcija saņem, piemēram, datumu.
ms_my: Ralat ini berlaku jika anda menggunakan fungsi yang memerlukan argumen teks (atau rentetan) dan sebaliknya anda memberikan tarikh, sebagai contoh.
nb_no: Denne feilen oppstår hvis du bruker en funksjon som krever et argument for tekst (eller streng), og du angir for eksempel en dato i stedet.
nl_nl: Deze fout doet zich voor als u een functie gebruikt waarvoor een argument met tekst (of een tekenreeks) is vereist, maar u bijvoorbeeld een datum opgeeft.
pl_pl: Ten błąd wystąpi, jeśli użyjesz funkcji, która wymaga argumentu w postaci tekstu (lub ciągu), ale zamiast niego podasz na przykład datę.
pt_br: Este erro ocorrerá se você usar uma função que exige um argumento de texto (ou cadeia de caracteres) e fornecer, por exemplo, uma data.
pt_pt: Este erro ocorre quando utiliza uma função que exige um argumento de texto (ou cadeia), mas apresenta, por exemplo, uma data.
ro_ro: Această eroare apare dacă utilizați o funcție care necesită un argument text (sau șir de caractere) și furnizați în schimb, de exemplu, o dată.
ru_ru: Эта ошибка возникает, когда функция требует аргумент в виде текста (или строки), а вы вместо этого передаете ей, например, дату.
sk_sk: Táto chyba sa vyskytne, ak používate funkciu, ktorá vyžaduje textový (alebo reťazcový) argument, ale namiesto toho zadáte napríklad dátum.
sl_si: Do te napake pride, če uporabite funkcijo, ki zahteva besedilni argument (ali argument niza), vendar pa namesto besedila navedete na primer datum.
sr_cyrl_rs: Ова грешка се јавља ако користите функцију која захтева текстуални аргумент (или ниску), а ви, на пример, наведете датум.
sr_latn_rs: Ova greška se javlja ako koristite funkciju koja zahteva tekstualni argument (ili nisku), a vi, na primer, navedete datum.
sv_se: Det här felet uppstår om du använder en funktion som kräver ett textargument (eller strängargument) och du anger, låt oss säga, ett datum istället.
th_th: ข้อผิดพลาดนี้จะเกิดขึ้นถ้าคุณใช้ฟังก์ชันที่ต้องการอาร์กิวเมนต์ข้อความ (หรือสตริง) และคุณใส่ค่า เช่น วันที่ แทน
tr_tr: Bu hata, bir metin (veya dize) bağımsız değişkeni gerektiren bir işlev kullandığınızda ancak bunun yerine, örneğin, tarih sağladığınızda oluşur.
uk_ua: Ця помилка стається, якщо замість обов’язкового тексту (або рядка) як аргумент для функції надається, наприклад, дата.
vi_vn: Lỗi này xảy ra nếu bạn sử dụng một hàm yêu cầu đối số là văn bản (hoặc chuỗi) và thay vào đó, bạn lại cung cấp ngày tháng chẳng hạn.
zh_cn: 如果使用的函数需要文本(或字符串)参数，但却提供日期之类的值，则会发生此错误。
zh_tw: 舉例來說，若您使用的函式需要文字 (或字串) 引數，但您提供了日期，就會發生此錯誤。
